["Titan Manga Licenses Kasuga Dragon'sIsekai MetallerManga", "From Old Country Bumpkin to Master SwordsmanAnime's 3rd Promo Video Reveals Takanori Nishikawa's Opening Theme", "Demon Slayer: The Hinokami Chronicles 2Game Streams 3 Character Videos", "Pierrot RevealsMahō no Shimai Lulutto LilyMagical Girl TV Anime for 2026 Premiere", "Inexpressive Kashiwada and Expressive OotaManga Gets TV Anime", "Reincarnated as a Dragon HatchlingLight Novels Get TV Anime", "'More Than a Married Couple, But Not Lovers'Manga Enters Final Part", "Kono Subarashii Sekai ni Shukufuku o! 3 -Bonus Stage-Anime Confirms Guest Cast", "Webtoon-Based Live-ActionTaxi DriverSeries Confirms Season 3", "Elden Ring: Shadow of the ErdtreeGame Nominated for Science Fiction, Fantasy Writers' Nebula Award", "28thDetective ConanFilm's 2nd Trailer Reveals King Gnu's Theme Song", "Batman Ninja vs. Yakuza LeagueFilm Streams 'GO! Bat Phoenix' Video", "Battle SpiritsCard Game Gets New TV Anime Series", "Shadowverse: Worlds BeyondGame Releases on June 17 After Delay", "Miho Okasaki, Toshihiko Seki Win 19th Annual Seiyū Awards", "Webtoon-Based Live-ActionMy Dearest NemesisShow Stays at #1 on Rakuten Viki", "Deadline: Claymore Manga Gets Live-Action TV Series", "Voice Actor Showtaro Morikubo Also Steps Down fromArknightsGame Role", "Nippon Ichi Software Teases 6 Titles, IncludingFuuraiki 5", "7 Major Webtoon Firms Demand Maximum Penalty for 'OKToon' Pirate Site Operator", "Butt Detective: Star and Moon Anime Film Announces Phantom Thief Cast", "Guilty Gear Strive: Dual RulersAnime Streams Credit-less Opening Sequence", "KOMACON Report: Number of Webtoon Titles Dropped by Nearly 7% in 2024", "Reincarnated as a Dragon Hatchling Light Novels Get TV Anime", "Harvest Moon Mobile Game Minori no Shima Ported to PC, Switch in Japanese", "The Dark History of the Reincarnated VillainessAnime's 1st Promo Video Reveals Fall Debut", "Shizumu Watanabe'sDead AccountManga Gets TV Anime at Synergy SP", "'More Than a Married Couple, But Not Lovers' Manga Enters Final Part", "BTS Singer Jin Hosts Variety Show With Webtoon Artist Kian, Comedian Ye-eun Ji", "The Mononoke Lecture Logs of Chuzenji-senseiAnime Casts 4 Classmates", "The Mononoke Lecture Logs of Chuzenji-sensei Anime Casts 4 Classmates", "TeogoniaAnime Reveals Aimi Noda's Opening Theme in 2nd Promo Video", "Summer PocketsAnime Posts 2nd Promotional Video, New Visual", "Though I Am an Inept VillainessLight Novels Tease Announcement on Monday", "Shizumu Watanabe's Dead Account Manga Gets TV Anime at Synergy SP", "Harvest MoonMobile GameMinori no ShimaPorted to PC, Switch in Japanese", "Witch WatchAnime Reveals Ending Song in 2nd Promo Video", "'With You, Our Love Will Make it Through'TV Anime Reveals Teaser Trailer, Staff, More Cast", "Sakamoto DaysAnime Adds 4 Cast Members", "Miss Kobayashi's Dragon Maid: A Lonely Dragon Wants to be LovedFilm Adds 4D Screenings in Japan", "The House in Fata MorganaVisual Novel has Live-Action Adaptation Planned", "Rocket Shokai, Nakashima723's Scum of the Brave Manga Gets TV Anime", "Webtoon-Based Live-Action My Dearest Nemesis Show Stays at #1 on Rakuten Viki", "GnosiaTV Anime Reveals Staff, Cast, October Debut in Trailer", "Voice Actor Dave Mallow Dies at 76", "Masakuni Igarashi's Tune In to the Midnight Heart Manga Gets TV Anime in 2026", "PalworldGame's Crossplay Update Slated for Late March", "Pierrot Reveals Mahō no Shimai Lulutto Lily Magical Girl TV Anime for 2026 Premiere", "Inexpressive Kashiwada and Expressive Oota Manga Gets TV Anime", "To Be Hero XAnime Confirms April 6 Debut, Reveals New Visual", "Yandere Dark ElfAnime's New Video Previews Theme Songs, Character Voices", "Butt Detective: Star and MoonAnime Film Announces Phantom Thief Cast", "Girls & Panzer: Motto Love Love Sakusen Desu! Spinoff Manga Gets 4-Part Theatrical Anime", "'Uglymug, Epicfighter'Anime Announces 3 Cast Members", "Kaiju No. 8Compilation Film to Play in N. American Theaters in April", "The Unaware Atelier MasterAnime's New Video Reveals More Cast, March 30 Advance Streaming", "Genshin ImpactGame Replaces Showtaro Morikubo With Junta Terashima as Ifa's Voice", "HIDIVE StreamsRock is a Lady's ModestyAnime", "Summer Pockets Anime Posts 2nd Promotional Video, New Visual", "'Kamiina Botan, Yoheru Sugata wa Yuri no Hana' Manga Gets TV Anime", "3rdMononokeFilm Announces Title, Spring 2026 Opening", "Webtoon-Based Live-Action Thriller SeriesField MouseConfirms Cast", "Cute High Earth Defense ClubFranchise Announces New TV Anime", "Rocket Shokai, Nakashima723'sScum of the BraveManga Gets TV Anime", "Masakuni Igarashi'sTune In to the Midnight HeartManga Gets TV Anime in 2026", "Live-ActionGannibal2nd Season's English-Subtitled Trailer Confirms March 19 Debut on Hulu", "Sound! EuphoniumFranchise Reveals 'Final Movie' Slated for 2026", "Me & RobocoAnime Film Casts Comedian Shōhei Osada", "Sakamoto Days Anime Adds 4 Cast Members", "Battle Spirits Card Game Gets New TV Anime Series", "The Brilliant Healer's New Life in the ShadowsAnime's New Promo Video Reveals sorato's Ending Theme", "Girls & Panzer: Motto Love Love Sakusen Desu!Spinoff Manga Gets 4-Part Theatrical Anime", "K Manga LicensesThe Battlefield Saint: I Was Made to Marry a Duke Knight in Place of My Little Sister, but I've since Found HappinessManga", "WWWave Corporation's New OceanVeil Streaming Platform Launches; Announces Partnership with Ascendent Animation", "FarmagiaAnime's 3rd Promo Video Previews Last Arc", "With You and the RainAnime Reveals 6 New Cast"]