["Manga Plus Adds Simulpub of NewMärchen CrownManga byOshi no Ko'sAka Akasaka", "Genshin ImpactGame Replaces Showtaro Morikubo With Junta Terashima as Ifa's Voice", "Deadline: Claymore Manga Gets Live-Action TV Series", "BTS Singer Jin Hosts Variety Show With Webtoon Artist Kian, Comedian Ye-eun Ji", "'More Than a Married Couple, But Not Lovers' Manga Enters Final Part", "Aniplex, Crunchyroll Establish Joint Venture for Anime Production", "Bleach: Rebirth of SoulsGame's New Trailer Previews Ichigo Kurosaki's Final Form", "Me & RobocoAnime Film Casts Comedian Shōhei Osada", "Kono Subarashii Sekai ni Shukufuku o! 3 -Bonus Stage-Anime Confirms Guest Cast", "The Dinner Table DetectiveAnime Adds Kunitachi City Mascots", "Welcome to the Outcast's Restaurant!TV Anime's Teaser Reveals Cast, Staff, July Debut", "Battle SpiritsCard Game Gets New TV Anime Series", "Harvest Moon Mobile Game Minori no Shima Ported to PC, Switch in Japanese", "MAPPA AnimatesArk: Lost ColonyGame's Teaser Video", "Live-ActionDr. AshuraSeries Reveals More Cast Members", "3rdMononokeFilm Announces Title, Spring 2026 Opening", "Inexpressive Kashiwada and Expressive OotaManga Gets TV Anime", "Reincarnated as a Dragon Hatchling Light Novels Get TV Anime", "TeogoniaAnime Reveals Aimi Noda's Opening Theme in 2nd Promo Video", "Sakamoto Days Anime Adds 4 Cast Members", "FarmagiaAnime's 3rd Promo Video Previews Last Arc", "7 Major Webtoon Firms Demand Maximum Penalty for 'OKToon' Pirate Site Operator", "Mumei no JinseiFilm's Trailer Announces 10 More Cast Members", "GnosiaTV Anime Reveals Staff, Cast, October Debut in Trailer", "28thDetective ConanFilm's 2nd Trailer Reveals King Gnu's Theme Song", "Harvest MoonMobile GameMinori no ShimaPorted to PC, Switch in Japanese", "WWWave Corporation's New OceanVeil Streaming Platform Launches; Announces Partnership with Ascendent Animation", "NewCat's EyeAnime Unveils Teaser, Cast, Staff, September Debut", "Island of Giant InsectsSequel Manga to End in Next Installment", "HIDIVE StreamsRock is a Lady's ModestyAnime", "Webtoon-Based Live-Action My Dearest Nemesis Show Stays at #1 on Rakuten Viki", "'Long Story Short, I'm Living in the Mountains' Manga to End in 4th Volume", "Voice Actor Dave Mallow Dies at 76", "Cross Infinite World Leaves Bookwalker Global After Latter's Ownership Change", "Live-ActionOne PieceSeries Wins 2 Children's & Family Emmy Awards", "Batman Ninja vs. Yakuza LeagueFilm Streams 9 Minute Clip With Both English/Japanese Dubs", "To Be Hero XAnime Confirms April 6 Debut, Reveals New Visual", "Though I Am an Inept VillainessLight Novels Tease Announcement on Monday", "Miss Kobayashi's Dragon Maid: A Lonely Dragon Wants to be LovedFilm Adds 4D Screenings in Japan", "Voice Actor Showtaro Morikubo Also Steps Down fromArknightsGame Role", "Reincarnated as a Dragon HatchlingLight Novels Get TV Anime", "Batman Ninja vs. Yakuza LeagueFilm Streams 'GO! Bat Phoenix' Video", "Masakuni Igarashi's Tune In to the Midnight Heart Manga Gets TV Anime in 2026", "The House in Fata MorganaVisual Novel has Live-Action Adaptation Planned", "Shizumu Watanabe'sDead AccountManga Gets TV Anime at Synergy SP", "Elden Ring: Shadow of the ErdtreeGame Nominated for Science Fiction, Fantasy Writers' Nebula Award", "Summer Pockets Anime Posts 2nd Promotional Video, New Visual", "With You and the RainAnime Reveals 6 New Cast", "K Manga LicensesThe Fable: The Third SecretManga", "Butt Detective: Star and MoonAnime Film Announces Phantom Thief Cast", "'Kamiina Botan, Yoheru Sugata wa Yuri no Hana' Manga Gets TV Anime", "PalworldGame's Crossplay Update Slated for Late March", "'More Than a Married Couple, But Not Lovers'Manga Enters Final Part", "Final FantasyFranchise Crosses 200 Million Copies Sold Worldwide", "Transformers: Wild KingAnime Shorts Launch on March 26", "Shadowverse: Worlds BeyondGame Releases on June 17 After Delay", "Girls & Panzer: Motto Love Love Sakusen Desu!Spinoff Manga Gets 4-Part Theatrical Anime", "From Old Country Bumpkin to Master SwordsmanAnime's 3rd Promo Video Reveals Takanori Nishikawa's Opening Theme", "Though I Am an Inept VillainessLight Novels' TV Anime Confirmed", "The Dark History of the Reincarnated VillainessAnime's 1st Promo Video Reveals Fall Debut", "Miho Okasaki, Toshihiko Seki Win 19th Annual Seiyū Awards", "Live-ActionGannibal2nd Season's English-Subtitled Trailer Confirms March 19 Debut on Hulu", "Pierrot Reveals Mahō no Shimai Lulutto Lily Magical Girl TV Anime for 2026 Premiere", "Guilty Gear Strive: Dual RulersAnime Streams Credit-less Opening Sequence", "K Manga LicensesThe Battlefield Saint: I Was Made to Marry a Duke Knight in Place of My Little Sister, but I've since Found HappinessManga", "The Mononoke Lecture Logs of Chuzenji-senseiAnime Casts 4 Classmates", "Battle Spirits Card Game Gets New TV Anime Series", "Sound! EuphoniumFranchise Reveals 'Final Movie' Slated for 2026", "Anji Matono Ends100 Ghost Stories That Will Lead to My DeathManga", "'With You, Our Love Will Make it Through'TV Anime Reveals Teaser Trailer, Staff, More Cast", "Thus Spoke Rohan KishibeManga Gets 1st New Story in 3 Years", "Sakamoto DaysAnime Adds 4 Cast Members", "Apocalypse Bringer MynoghraAnime's Teaser Announces More Cast, Staff, July Debut", "Webtoon-Based Live-ActionTaxi DriverSeries Confirms Season 3", "Titan Manga Licenses Kasuga Dragon'sIsekai MetallerManga", "Masakuni Igarashi'sTune In to the Midnight HeartManga Gets TV Anime in 2026", "Private Tutor to the Duke's DaughterAnime's Teaser Unveils July Debut", "The Unaware Atelier MasterAnime's New Video Reveals More Cast, March 30 Advance Streaming", "Yandere Dark ElfAnime's New Video Previews Theme Songs, Character Voices", "Nippon Ichi Software Teases 6 Titles, IncludingFuuraiki 5", "Rocket Shokai, Nakashima723'sScum of the BraveManga Gets TV Anime", "KOMACON Report: Number of Webtoon Titles Dropped by Nearly 7% in 2024", "Butt Detective: Star and Moon Anime Film Announces Phantom Thief Cast", "A Wild Last Boss Appeared!Anime Reveals 5 More Cast Members", "Kaiju No. 8Compilation Film to Play in N. American Theaters in April", "Cute High Earth Defense ClubFranchise Announces New TV Anime", "Voice Actor Shiki Aoki Goes on Hiatus Due to Health", "Demon Slayer: The Hinokami Chronicles 2Game Streams 3 Character Videos", "Inexpressive Kashiwada and Expressive Oota Manga Gets TV Anime", "Manga Adaptation of Harunadon'sKōkyū Shakki-denLight Novels Listed to End in 3rd Volume", "The Brilliant Healer's New Life in the ShadowsAnime's New Promo Video Reveals sorato's Ending Theme", "Witch WatchAnime Reveals Ending Song in 2nd Promo Video", "'Uglymug, Epicfighter'Anime Announces 3 Cast Members", "Webtoon-Based Live-Action Thriller SeriesField MouseConfirms Cast", "Rocket Shokai, Nakashima723's Scum of the Brave Manga Gets TV Anime", "Shizumu Watanabe's Dead Account Manga Gets TV Anime at Synergy SP", "The Mononoke Lecture Logs of Chuzenji-sensei Anime Casts 4 Classmates", "Webtoon-Based Live-ActionMy Dearest NemesisShow Stays at #1 on Rakuten Viki", "Final Fantasy VII RebirthWins Game of the Year Award at Famitsu Dengeki Game Awards 2024", "Pierrot RevealsMahō no Shimai Lulutto LilyMagical Girl TV Anime for 2026 Premiere", "Girls & Panzer: Motto Love Love Sakusen Desu! Spinoff Manga Gets 4-Part Theatrical Anime", "Summer PocketsAnime Posts 2nd Promotional Video, New Visual"]